[
    {
      "id": 1,
      "title": "The Bourne Identity",
      "author": "Robert Ludlum",
      "cover": "https://m.media-amazon.com/images/I/71OvQm6MyQL._SY522_.jpg",
      "summary": "A gripping spy thriller following an amnesiac protagonist as he unravels his mysterious past amidst international intrigue.",
      "genre": "Action/Thriller",
      "publishDate": "June 1, 1980",
      "pages": 510,
      "rating": 4.5,
      "longDescription": "His memory is a blank. His bullet-ridden body was fished from the Mediterranean Sea. His face has been altered by plastic surgery. A frame of microfilm has been surgically implanted in his hip. Even his name is a mystery. Marked for death, he is racing for survival through a bizarre world of murderous conspirators—led by Carlos, the world’s most dangerous assassin. Who is Jason Bourne? The answer may kill him."
    },
    {
      "id": 2,
      "title": "The Hunt for Red October",
      "author": "Tom Clancy",
      "cover": "https://m.media-amazon.com/images/I/81u++Pu-TFL._SY522_.jpg",
      "summary": "A riveting Cold War submarine thriller that follows a Soviet captain defying orders to secure his own fate.",
      "genre": "Action/Thriller",
      "publishDate": "April 1, 1984",
      "pages": 395,
      "rating": 4.6,
      "longDescription": "Somewhere under the freezing Atlantic, a Soviet sub commander has just made a fateful decision. The Red October is heading west. The Americans want her. The Russians want her back. The chase for the highly advanced nuclear submarine is on—and there’s only one man who can find her... Brilliant CIA analyst Jack Ryan has little interest in fieldwork, but when covert photographs of Red October land on his desk, Ryan soon finds himself in the middle of a high-stakes game of hide-and-seek played by two world powers—a game that could end in all-out war."
    },
    {
      "id": 3,
      "title": "A Court of Thorns and Roses",
      "author": "Sarah J. Maas",
      "cover": "https://m.media-amazon.com/images/I/51ZvROcTcfL._SY445_SX342_.jpg",
      "summary": "A fantastical retelling of a classic tale, blending romance, peril, and magic in a richly imagined world.",
      "genre": "Fantasy/Romance",
      "publishDate": "May 5, 2015",
      "pages": 432,
      "rating": 4.7,
      "longDescription": "When nineteen-year-old huntress Feyre kills a wolf in the woods, a terrifying creature arrives to demand retribution. Dragged to a treacherous magical land she knows about only from legends, Feyre discovers that her captor is not truly a beast, but one of the lethal, immortal faeries who once ruled her world. At least, he's not a beast all the time. As she adapts to her new home, her feelings for the faerie, Tamlin, transform from icy hostility into a fiery passion that burns through every lie she's been told about the beautiful, dangerous world of the Fae. But something is not right in the faerie lands. An ancient, wicked shadow is growing, and Feyre must find a way to stop it, or doom Tamlin-and his world-forever. From bestselling author Sarah J. Maas comes a seductive, breathtaking book that blends romance, adventure, and faerie lore into an unforgettable read."
    },
    {
      "id": 4,
      "title": "A Game of Thrones",
      "author": "George R.R. Martin",
      "cover": "https://m.media-amazon.com/images/I/71Jzezm8CBL._SL1200_.jpg",
      "summary": "An epic tale of power, betrayal, and the fight for survival in a world where seasons last a lifetime.",
      "genre": "Epic Fantasy",
      "publishDate": "August 6, 1996",
      "pages": 694,
      "rating": 4.8,
      "longDescription": "Winter is coming. Such is the stern motto of House Stark, the northernmost of the fiefdoms that owe allegiance to King Robert Baratheon in far-off King’s Landing. There Eddard Stark of Winterfell rules in Robert’s name. There his family dwells in peace and comfort: his proud wife, Catelyn; his sons Robb, Brandon, and Rickon; his daughters Sansa and Arya; and his bastard son, Jon Snow. Far to the north, behind the towering Wall, lie savage Wildings and worse—unnatural things relegated to myth during the centuries-long summer, but proving all too real and all too deadly in the turning of the season. Yet a more immediate threat lurks to the south, where Jon Arryn, the Hand of the King, has died under mysterious circumstances. Now Robert is riding north to Winterfell, bringing his queen, the lovely but cold Cersei, his son, the cruel, vainglorious Prince Joffrey, and the queen’s brothers Jaime and Tyrion of the powerful and wealthy House Lannister—the first a swordsman without equal, the second a dwarf whose stunted stature belies a brilliant mind. All are heading for Winterfell and a fateful encounter that will change the course of kingdoms. Meanwhile, across the Narrow Sea, Prince Viserys, heir of the fallen House Targaryen, which once ruled all of Westeros, schemes to reclaim the throne with an army of barbarian Dothraki—whose loyalty he will purchase in the only coin left to him: his beautiful yet innocent sister, Daenerys."
    },
    {
      "id": 5,
      "title": "The Cruel Prince",
      "author": "Holly Black",
      "cover": "https://m.media-amazon.com/images/I/51ZB4DImnlL._SY445_SX342_.jpg",
      "summary": "A dark and intoxicating tale of court intrigue, power struggles, and the price of ambition in a world of faeries.",
      "genre": "Fantasy",
      "publishDate": "May 2, 2018",
      "pages": 416,
      "rating": 4.3,
      "longDescription": "Of course I want to be like them. They're beautiful as blades forged in some divine fire. They will live forever. \n\nAnd Cardan is even more beautiful than the rest. I hate him more than all the others. I hate him so much that sometimes when I look at him, I can hardly breathe. \n\nJude was seven years old when her parents were murdered and she and her two sisters were stolen away to live in the treacherous High Court of Faerie. Ten years later, Jude wants nothing more than to belong there, despite her mortality. But many of the fey despise humans. Especially Prince Cardan, the youngest and wickedest son of the High King. \n\nTo win a place at the Court, she must defy him--and face the consequences. \n\nIn doing so, she becomes embroiled in palace intrigues and deceptions, discovering her own capacity for bloodshed. But as civil war threatens to drown the Courts of Faerie in violence, Jude will need to risk her life in a dangerous alliance to save her sisters, and Faerie itself."
    },
    {
      "id": 6,
      "title": "The Witcher: Blood of Elves",
      "author": "Andrzej Sapkowski",
      "cover": "https://m.media-amazon.com/images/I/81Al+uu84qL._SY522_.jpg",
      "summary": "A spellbinding fantasy that introduces Geralt of Rivia, a witcher bound by destiny to battle monstrous foes and unravel political conspiracies.",
      "genre": "Fantasy/Adventure",
      "publishDate": "April 1, 1994",
      "pages": 384,
      "rating": 4.6,
      "longDescription": "For over a century, humans, dwarves, gnomes, and elves have lived together in relative peace. But that peace has now come to an end. Geralt of Rivia, the hunter known as the Witcher, has been waiting for the birth of a prophesied child. The one who has the power to change the world for good—or for evil. As the threat of war hangs over the land and the child is pursued for her extraordinary powers, it will become Geralt’s responsibility to protect them all. And the Witcher never accepts defeat."
    },
    {
      "id": 7,
      "title": "The Priory of the Orange Tree",
      "author": "Samantha Shannon",
      "cover": "https://m.media-amazon.com/images/I/91NXdVnMoGL._SY522_.jpg",
      "summary": "A sweeping epic that reimagines high fantasy with dragons, intricate politics, and a tapestry of diverse characters.",
      "genre": "Epic Fantasy",
      "publishDate": "February 26, 2019",
      "pages": 848,
      "rating": 4.7,
      "longDescription": "The House of Berethnet has ruled Inys for a thousand years. Still unwed, Queen Sabran the Ninth must conceive a daughter to protect her realm from destruction--but assassins are getting closer to her door. Ead Duryan is an outsider at court. Though she has risen to the position of lady-in-waiting, she is loyal to a hidden society of mages. Ead keeps a watchful eye on Sabran, secretly protecting her with forbidden magic. Across the dark sea, Tané has trained all her life to be a dragonrider, but is forced to make a choice that could see her life unravel. Meanwhile, the divided East and West refuse to parley, and forces of chaos are rising from their sleep."
    },
    {
      "id": 8,
      "title": "The Catcher in the Rye",
      "author": "J. D. Salinger",
      "cover": "https://m.media-amazon.com/images/I/518dVCGFuhL._SY445_SX342_.jpg",
      "summary": "A seminal coming-of-age novel capturing the raw voice and disillusionment of post-war youth.",
      "genre": "Literary Fiction",
      "publishDate": "July 16, 1951",
      "pages": 277,
      "rating": 4.2,
      "longDescription": "Anyone who has read J.D. Salinger's New Yorker stories--particularly A Perfect Day for Bananafish, Uncle Wiggily in Connecticut, The Laughing Man, and For Esme With Love and Squalor--will not be surprised by the fact that his first novel is full of children. The hero-narrator of The Catcher in the Rye is an ancient child of sixteen, a native New Yorker named Holden Caulfield. Through circumstances that tend to preclude adult, secondhand description, he leaves his prep school in Pennsylvania and goes underground in New York City for three days. The boy himself is at once too simple and too complex for us to make any final comment about him or his story. Perhaps the safest thing we can say about Holden is that he was born in the world not just strongly attracted to beauty but, almost, hopelessly impaled on it. There are many voices in this novel: children's voices, adult voices, underground voices-but Holden's voice is the most eloquent of all. Transcending his own vernacular, yet remaining marvelously faithful to it, he issues a perfectly articulated cry of mixed pain and pleasure. However, like most lovers and clowns and poets of the higher orders, he keeps most of the pain to, and for, himself. The pleasure he gives away, or sets aside, with all his heart. It is there for the reader who can handle it to keep."
    },
    {
      "id": 9,
      "title": "The Hunger Games",
      "author": "Suzanne Collins",
      "cover": "https://m.media-amazon.com/images/I/41I0GHe7MdL._SY445_SX342_.jpg",
      "summary": "A dystopian thriller where survival is a deadly game, set in a future where society is controlled by oppressive forces.",
      "genre": "Dystopian/Young Adult",
      "publishDate": "September 14, 2008",
      "pages": 374,
      "rating": 4.6,
      "longDescription": "In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. Long ago the districts waged war on the Capitol and were defeated. As part of the surrender terms, each district agreed to send one boy and one girl to appear in an annual televised event called, \"The Hunger Games,\" a fight to the death on live TV. Sixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she is forced to represent her district in the Games. The terrain, rules, and level of audience participation may change but one thing is constant: kill or be killed."
    },
    {
      "id": 10,
      "title": "The Godfather",
      "author": "Mario Puzo",
      "cover": "https://m.media-amazon.com/images/I/71AKo0Vf-hL._SY522_.jpg",
      "summary": "An iconic crime saga chronicling the rise and complexities of a powerful mafia family in post-war America.",
      "genre": "Crime/Drama",
      "publishDate": "March 10, 1969",
      "pages": 448,
      "rating": 4.8,
      "longDescription": "With its brilliant and brutal portrayal of the Corleone family, The Godfather burned its way into our national consciousness. This unforgettable saga of crime and corruption, passion and loyalty continues to stand the test of time, as the definitive novel of the Mafia underworld. \n\nA #1 New York Times bestseller in 1969, Mario Puzo’s epic was turned into the incomparable film of the same name, directed by Francis Ford Coppola, which won the Academy Award for Best Picture. It is the original classic that has been often imitated, but never matched. A tale of family and society, law and order, obedience and rebellion, it reveals the dark passions of human nature played out against a backdrop of the American dream"
    }
  ]
  